using System.Collections.Generic;

namespace TelegramBot
{
    static class Settings
    {
        static public readonly string TOKEN = "1690989074:AAHTr0_NfqXmtJYwPZ2LFP1PGOcQohrY6ao";
        
        static public int[] AdminsList = {643559378, 849717955};
        
        static public List<int> UsersList = new List<int>();
        static public readonly int Owner;

        public static string Author = "Я розроблений командою профбюро факультету математики та інформатики.";
        public static string AboutEvent = 
            $"Бот створений для того, щоб кожен з вас міг взяти участь в івенті присвяченому 8 березня! \n\n\n" +
            $"- До 8.03  усі бажаючі дівчата можуть додати необмежену кількість \"міні-завдань\" для протилежної статі. \n\n" +
            $"В день івенту ці завдання рандомним чином будуть потрапляти до \"виконавців-чоловіків\", " +
            $"\n яким потрібно зняти інстаграм історію або пост із виконанням завдання та викласти із згадуванням нашої сторінки та відповідним #. \n\n" +
            "За кожне виконане завдання будуть даватись бали. В результаті визначиться переможець з найбільшою кількістю балів, який отримає приз! " +
            "\n\nНеобхідно: " +
            "\n\n- Після того, як людина відмітить в телеграм боті завдання як виконане - усім адміністаторам прийде повідомлення з ім'ям людини, описом завдання, його інстаграмом та ключовим 4-х значним кодом.\n" +
            "\nДії адміністраторів дуже прості - перекинути цей код в інстаграм користувачеві, за умови, що він усе виконав.";
    }
}